// Напишите программу, которая принимает на вход
// трёхзначное целое число и на выходе показывает сумму
// первой и последней цифры этого числа.

Console.Write("Введите целое трёхзначное число: ");
int num = Convert.ToInt32(Console.ReadLine());
